cavity/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (  0 0    0)//0
    (100 0    0)//1
    (100 0    1)//2
    (  0 0    1)//3
    (  0 0.5  0)//4
    (100 0.5  0)//5
    (100 0.5  1)//6
    (  0 0.5  1)//7
    (  0 0.8  0)//8
    (100 0.8  0)//9
    (100 0.8  1)//10
    (  0 0.8  1)//11
    (  0 1.95 0)//12
    (100 1.95 0)//13
    (100 1.95 1)//14
    (  0 1.95 1)//15
    (  0 30   0)//16
    (100 30   0)//17
    (100 30   1)//18
    (  0 30   1)//19
    ( -5 0    0)//20
    ( -5 0    1)//21
    ( -5 0.5  0)//22
    ( -5 0.5  1)//23
    ( -5 0.8  0)//24
    ( -5 0.8  1)//25
    ( -5 1.95 0)//26
    ( -5 1.95 1)//27
    
);

nz1  100;//nz2*20
nz2  5;
nz3  10;
nz4  5;//nz3/2
nz5  3;//0.3*nz3/1.15
nz6  244;//28.05*nz3/1.15

blocks
(
    hex (0 1 5 4 3 2 6 7        ) ($nz1 $nz4 1) simpleGrading (1 1 1)//area4
    hex (4 5 9 8 7 6 10 11      ) ($nz1 $nz5 1) simpleGrading (1 1 1)//area3
    hex (8 9 13 12 11 10 14 15  ) ($nz1 $nz3 1) simpleGrading (1 1 1)//area2
    hex (12 13 17 16 15 14 18 19) ($nz1 $nz6 1) simpleGrading (1 1 1)//area1
    hex (20 0 4 22 21 3 7 23    ) ($nz2 $nz4 1) simpleGrading (1 1 1)//area9
    hex (24 8 12 26 25 11 15 27 ) ($nz2 $nz3 1) simpleGrading (1 1 1)//area8
);
	
edges
(
);

boundary
(

   inlet1
    {
        type patch;
        faces
        (
            (23 21 20 22)
        );
    }

    inlet2
    {
        type patch;
        faces
        (
            (27 25 24 26)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (17 13 14 18)
            (13 9 10 14 )
            (9 5 6 10   )
            (5 1 2 6    )
        );
    }


    axis
    {
        type symmetryPlane;
        faces
        (
             (20 21 3 0)
	     (0 3 2 1  )
        );
    }

    wall
    {
        type wall;
        faces
        (
            (19 16 17 18)
	    (19 15 12 16)
	    (15 27 26 12)
	    (11 25 24  8)
	    (11 7  4   8)
	    (7  23 22  4)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (16 12 13 17)
            (12 8  9  13)
	    (8  4  5   9)
	    (4  0  1   5)
            (22 20 0   4)
	    (26 24 8  12)
	    (19 15 14 18)
	    (15 11 10 14)
	    (11 7  6  10)
	    (7  3  2   6)
	    (23 21  3  7)
	    (27 25 11 15)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //paraFoam


